sample/output_v1.1.log

Jul 21, 2010 10:41:44 PM example.helloWorld.jaxws.HelloWorld_Service <clinit>
WARNING: Failed to create URL for the wsdl Location: './wsdl/HelloWorld.wsdl', retrying as a local file
Jul 21, 2010 10:41:44 PM example.helloWorld.jaxws.HelloWorld_Service <clinit>
WARNING: no protocol: ./wsdl/HelloWorld.wsdl
Calling SYNC api
---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP response - http://localhost:7001/helloWorld - 200]---
Transfer-encoding: chunked
null: HTTP/1.1 200 OK
Content-type: text/xml;charset="utf-8"
X-powered-by: Servlet/2.5 JSP/2.1
Date: Thu, 22 Jul 2010 02:41:46 GMT
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorldResponse xmlns:ns2="http://www.example.org/HelloWorld/"><out>Hello World 'Helter Scelter Thinks this is a bug' took 5000ms </out></ns2:HelloWorldResponse></S:Body></S:Envelope>--------------------

Resp: Hello World 'Helter Scelter Thinks this is a bug' took 5000ms 
1279766511377::  calling async #0
1279766511393::  calling async #1
1279766511393::  calling async #2
1279766511393::  calling async #3
1279766511393::  calling async #4
1279766511393::  calling async #5
1279766511393::  calling async #6
1279766511393::  calling async #7
1279766511393::  calling async #8
1279766511393::  calling async #9
1279766511393::  Canceling #0
---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 3: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511377:: 0: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 2: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 5: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

1279766511408::  Canceling #1
1279766511424::  Canceling #2
1279766511424::  Canceling #3
1279766511424::  Canceling #4
1279766511424::  Canceling #5
1279766511424::  Canceling #6
1279766511424::  Canceling #7
1279766511424::  Canceling #8
1279766511424::  Canceling #9
1279766511424:: 0: isCanceled:true
1279766511424:: 0: isDone:true
1279766511424:: 1: isCanceled:true
1279766511424:: 1: isDone:true
1279766511424:: 2: isCanceled:true
1279766511424:: 2: isDone:true
1279766511424:: 3: isCanceled:true
1279766511424:: 3: isDone:true
1279766511424:: 4: isCanceled:true
1279766511424:: 4: isDone:true
1279766511424:: 5: isCanceled:true
1279766511424:: 5: isDone:true
1279766511424:: 6: isCanceled:true
1279766511424:: 6: isDone:true
1279766511424:: 7: isCanceled:true
1279766511424:: 7: isDone:true
1279766511424:: 8: isCanceled:true
1279766511424:: 8: isDone:true
1279766511424:: 9: isCanceled:true
1279766511424:: 9: isDone:true
---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 4: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 1: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 8: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 7: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 6: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

---[HTTP request - http://localhost:7001/helloWorld]---
Content-type: text/xml;charset="utf-8"
Soapaction: "http://www.example.org/HelloWorld/HelloWorld"
Accept: text/xml, multipart/related, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorld xmlns:ns2="http://www.example.org/HelloWorld/"><in>1279766511393:: 9: 'Helter Scelter Thinks this is a bug'</in></ns2:HelloWorld></S:Body></S:Envelope>--------------------

Caught Exception for #0
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #1
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #2
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #3
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #4
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #5
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #6
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #7
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #8
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)
Caught Exception for #9
java.util.concurrent.CancellationException
	at java.util.concurrent.FutureTask$Sync.innerGet(Unknown Source)
	at java.util.concurrent.FutureTask.get(Unknown Source)
	at test.client.HelloWorldAsyncClient.main(HelloWorldAsyncClient.java:75)

